{
    "original_url": "https://arstechnica.com/?p=1993804",
    "requested_url": "https://arstechnica.com/?p=1993804",
    "fetch_time": "2024-01-05T18:00:42Z",
    "status_code": 200,
    "title": "1D Pac-Man is the best game I’ve played in 2024 (so far)",
    "description": "An appreciation of \"small games\" and the people who make them.",
    "author": "Kyle Orland",
    "sitename": "Ars Technica",
    "date": "2024-01-01T00:00:00Z",
    "language": "en",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/paku2-1-760x318.png",
    "page_type": "article",
    "url": "https://arstechnica.com/gaming/2024/01/1d-pac-man-is-the-best-game-ive-played-in-2024-so-far/",
    "hostname": "arstechnica.com",
    "content_text": "nothing to do with the choice. When looking back at the short history of video game design, the '90s and '00s transition from primarily 2D games to primarily 3D games is rightly seen as one of the biggest revolutions in the industry. But my discovery this week of the one-dimensional, Pac-Man -inspired Paku Paku makes me wish that the game industry had some sort of pre-history where clever 1D games like this were the norm. It also makes me wish I had been quicker to discover more of the work of extremely prolific and clever game designer Kenta Cho, who made the game. In Paku Paku , Pac-Man 's 2D maze of 240 dots has been replaced with 16 dots arranged in a single line. Your six-pixel tall dot-muncher (the graphics are 2D, even as the gameplay uses only one dimension) is forced to forever travel either left or right along this line, trying to eat all the dots while avoiding a single red ghost (who moves just a bit faster than the player). To do this, the player can use a single power pellet (which makes the ghost edible for a short while) or the screen-wrapping tunnels on either side of the line (which the ghost can't use). Paku Paku . Though Paku Paku was originally released last year, the game has been making the rounds among some major link aggregators recently, a perfect filler for the usual post-holiday drought of major game releases in early January. Hacker News users are even hard at work coding basic AI that you can paste into a browser's command window for easy high scores. The zen design of small games Paku Paku is far from the first game to reduce gameplay to a single dimension (though the graphics use two dimensions, which might make the game \"1.5D\"?). Games like Wolfenstein 1D (which is Archived but currently unplayable due to the death of Flash) and installations like Line Wobbler use color as a sort of second dimension, representing different in-game characters and objects with dots of many hues. And dozens of 1D games have been tagged on indie gaming hub Itch.io, ranging from the silly ( 1D Flappy Bird ) to the surprisingly effective ( Colordash 1D ) to the overcomplicated ( 1D Minecraft ). Paku Paku stands out from this limited crowd largely thanks to tight single-button controls and perfectly tuned risk-versus-reward gameplay that encourages that compulsive loop. Perhaps that's because its creator has had a ridiculous amount of experience crafting this kind of simple game."
  }